const lotrDescription = {
    'shire': '&emsp;Это внутренняя территория, населённая исключительно хоббитами, которые в значительной степени защищены от событий, происходящих в остальном Средиземье.<br>&emsp;В Шире хоббиты ведут спокойную и размеренную жизнь, занимаясь сельским хозяйством и обустраивая свои уютные норы. Природа Шира отличается красотой и разнообразием: здесь есть и зелёные луга, и густые леса, и живописные холмы. Климат в Шире мягкий и благоприятный для земледелия.<br>&emsp;Хоббиты ценят уют и комфорт, любят вкусно поесть и хорошо провести время в кругу друзей и семьи. Они гостеприимны и дружелюбны, всегда готовы прийти на помощь друг другу.',
    'bree': '&emsp;Бри — крупнейший город Эриадора до Четвёртой Эпохи, расположенный на пересечении Великого Западного Тракта и Зелёного Тракта, к северо-востоку от Шира и к югу от руин Форноста.<br>&emsp;Бри застроен плотно, в нём около сотни каменных домов. Многие дома построены с использованием смешанного типа построек: первые этажи из камня, а вторые (третьи были редкостью) — из дерева. Большинство домов повёрнуто парадными фасадами на запад — к Великому Тракту.<br>&emsp;Природа вокруг Бри разнообразна: с запада город окружают Могильники и Старый Лес, где живёт Том Бомбадил, а с юго-востока — Четвудский лес.<br>&emsp;Население Бри составляют преимущественно люди, которые отличаются своим весёлым и независимым нравом.',
    'amon-sul': '&emsp;Башня Амон Сул была построена в ранние дни Северного королевства Арнора, когда её коническую вершину слегка выровняли, чтобы построить на ней башню. Внутри неё находился камень Амона Сула, одного из трёх палантиров Арнора, что делало башню стратегически важной для наблюдения и связи с королём в Аннуминасе или позже в Форност-Эрейне.<br>&emsp;В 1409 году силы короля-чародея атаковали холм Уэзертоп, сожгли сторожевую башню и разрушили укрепления на нём и вокруг него. К тому времени от башни Амон Сул на вершине холма Уэзертоп осталось лишь кольцо из разрушенной каменной кладки.<br>&emsp;Именно под этой башней Фродо получил свою вечную рану от ножа Моргула короля-колдуна.',
    'troll-forest': '&emsp;Троллистая пуща — это мрачный и опасный лес в Средиземье, расположенный в Мглистых горах. Здесь растут огромные деревья, чьи ветви переплетаются так густо, что солнечный свет почти не проникает сквозь них. Земля покрыта толстым слоем опавших листьев, которые гниют и источают неприятный запах.<br>&emsp;В Троллистой пуще обитают различные опасные существа, такие как тролли, орки и другие монстры. Здесь царит атмосфера страха и опасности, и любой, кто осмелится войти в этот лес, должен быть готов к битве за свою жизнь.<br>&emsp; Здесь можно найти уникальные виды грибов и трав, которые больше нигде не встречаются, ещё в лесу обитают некоторые виды существ, приспособившиеся к жизни в таких условиях.',
    'Rivendell': '&emsp;Ривенделл расположен в восточном Эриадоре, на краю узкого ущелья реки Бруинен. Он хорошо скрыт вересковыми пустошами и предгорьями Хитаэглира, или Туманных гор.<br>&emsp;Ривенделл был основан во Вторую эпоху после разрушения тёмным лордом Сауроном эльфийской земли Эрегион. Это единственное эльфийское поселение в восточном Эриадоре, которое пережило неоднократные нападения армий короля-волшебника Ангмара в Третью эпоху.<br>&emsp;Ривенделл известен своей красотой и спокойствием. Это место, где можно отдохнуть от опасностей и тревог внешнего мира, насладиться красотой природы и общением с мудрыми и добрыми существами.',
    'moria': '&emsp;Мория, также известная как Кхазад-дум, представляет собой обширный подземный город-государство в Мглистых горах Средиземья. Основанная гномами рода Дурина, Мория на протяжении многих веков служила центром гномьей промышленности и торговли. Город был известен своими шахтами, залами и переходами, соединёнными сетью туннелей.<br>&emsp;Архитектурный стиль Мории характеризуется массивными каменными блоками, арочными проходами и высокими колоннами. Во множестве мастерских гномы создавали свои знаменитые изделия из металла и камня.<br>&emsp;Но со временем Мория стала местом страха и зла. После того как гномы были изгнаны балрогом, Мория осталась заброшенной на долгие годы.',
    'Argonat': '&emsp;Аргонат, также известный как Врата Аргоната или Столпы Королей, является великим памятником Гондора, расположенным на севере королевства. Он отмечает северную границу Гондора и находится у северного входа в Нен Хитоэль, на берегу реки Андуин. Аргонат состоит из двух огромных статуй, вырезанных по подобию Исильдура и Анариона, основателей Гондора. Статуи стоят по обе стороны реки, держа в руках корону и шлем, а также топор и поднятую в предупреждающем жесте левую руку.<br>&emsp;Аргонат был построен по приказу Ромендасила II после его победы над истерлингами в 1248 году Третьей эпохи.',
    'Rohan': '&emsp;Рохан является государством в Средиземье, расположенным к северу от Гондора и северо-западу от Мордора. Это земля, где живут рохиррим, известные как талантливые и непревзойдённые на Западе наездники. Рохан описывается как “море травы”, представляющее собой равнины, продуваемые ветрами, что делает его степной страной с умеренно континентальным климатом, жарким летом и морозной, но короткой зимой.<br>&emsp;Рохиррим, жители Рохана, происходят от Эотеод, народа, который был вознагражден землями провинции Каленардон за их заслуги в битве на реке Келебрант. Они имеют отдаленное родство с дунэдайн Гондора и известны своим мастерством верховой езды и кавалерийскими навыками.',
    'Gondor': '&emsp;Гондор — это южное королевство людей-дунэдайн в Средиземье, основанное в конце Второй Эпохи нуменорцами. Оно расположено на юго-востоке Средиземья, между Мглистыми горами и морем Рун. Гондор был одним из самых могущественных государств Средиземья.<br>&emsp;В течение многих лет Гондор процветал, но со временем его мощь начала ослабевать. В Третью Эпоху Гондор столкнулся с угрозой со стороны Мордора и его союзников, но по прежнему оставался одним из самых могущественных государств.<br>&emsp;В культуре Гондора большое значение придавалось искусству, литературе и архитектуре. Крепости и города Гондора были построены с большим мастерством и изяществом.',
    'Mordor': '&emsp;Мордор представляет собой огромную пустынную территорию, покрытую пеплом и дымом. Здесь находятся действующие вулканы, включая Ородруин, где Саурон выковал Единое Кольцо. Мордор окружён тремя горными хребтами, которые защищают его от внешнего мира и не дают жителям сбежать.<br>&emsp;В Мордоре расположены несколько ключевых мест, таких как Барад-дур – Тёмная Башня, где обитает Саурон, и Чёрные Врата – главный вход в Мордор. Также здесь есть Горгорот – засушливое плато, где находится действующий вулкан, и Кирит Унгол – логово гигантского паука Шелоб.'
}

const swDescription = {
    'alderaan': '&emsp;Альдераан — планета земного типа с мягким климатом, лугами, небольшими морями, лесами и горами. Столица планеты, Альдера, расположена на маленьком острове в центре кальдеры. Город Кревасс-сити построен на стенах каньона, а другие города — на сваях вдоль береговой линии или под полярными ледниками.<br>&emsp;Альдераанцы стремятся к гармоничному сосуществованию с природой, что отражается в способе постройки городов. Планета известна своей разнообразной флорой и фауной, включая нерфов и трантов.<br>&emsp;Альдераан играл важную роль в галактической политике. Планета экспортировала вино, произведения искусства и предметы роскоши.',
    'datomir': '&emsp;Датомир расположен в секторе Квелия Внешнего Кольца и является родиной ранкоров — крупных травоядных зверей. Поверхность Датомира по размерам немного уступает Корусанту, а гравитация чуть ниже стандартной. Планетарный день длится стандартно, а год насчитывает 491 день. У Датомира есть четыре луны.<br>&emsp;Климат и география планеты разнообразны: здесь есть озёра, густые леса, заснеженные горные пики, бушующие реки, широкие саванны, ледниковые покровы и долины. Фауна Датомира богата и включает в себя таких животных, как болмы, брейксеты, пуаболы, свиногрызуны, ящеры-летуны и зияющие пауки.',
    'kamino': '&emsp;Камино расположена в Диком Пространстве, вдали от основных торговых путей, и является домом для каминоанцев — высоких, элегантных существ, предпочитающих уединённый образ жизни.<br>&emsp;Камино имеет умеренный климат и полностью покрыта океаном, за исключением небольших островов, бывших вершинами гор. Планета обладает богатой гидросферой и насыщенной атмосферой, пригодной для дыхания.<br>&emsp;Каминоанцы известны как специалисты по клонированию. Они создали армию клонов для Республики, используя ДНК мастера-джедая Джанго Фетта в качестве прототипа. Каминоанцы также создали множество других клонов для различных целей, включая работу на шахтах.',
    'korriban': '&emsp;Планета расположена в системе Хорусет и является единственным пригодным для жизни миром в этой системе.<br>&emsp;Коррибан покрыт древними руинами и гробницами, которые хранят тайны ситхов. Планета имеет сильную ауру Тёмной стороны Силы, что делает её идеальным местом для обучения искусству ситхов.<br>&emsp;Коррибан известен своими зловещими пейзажами, обугленными трупами и злыми духами, которые населяют планету. Здесь можно найти множество древних гробниц, в том числе гробницу Лудо Кресша.<br>&emsp;Фауна Коррибана представлена различными видами опасных существ, включая хссиссов.',
    'korusant': '&emsp;Корусант является политически и стратегически важной планетой, служащей столицей и резиденцией правительства Республики и Империи, а также штаб-квартирой Ордена джедаев.<br>&emsp;Корусант обычно изображается как шумный, но сильно стратифицированный мегаполис, охватывающий всю планету. На протяжении многовекового развития города новые городские кварталы возводились поверх старых, образуя уровни. Всего на Корусанте 5127 уровней, причём 5127-й является самым богатым, а 1-й — самым бедным.<br>&emsp;Корусант имеет четыре спутника и является шестой планетой из одиннадцати, составляющих одноимённую систему.',
    'mandalor': '&emsp;Мандалор — планета во Внешнем Кольце галактики, родной мир мандалорцев. Длившиеся годами войны сделали её негостеприимной, вынуждая мандалорцев жить в куполообразных городах. После окончания этих войн на планете укрепился пацифистский режим под руководством герцогини Сатин Крайз, в то время как несогласные с новым антимилитаристским курсом были сосланы на луну Конкордию. В последствие эти отщепенцы сформировали группу, известную как «Дозор смерти», ратуя за возвращение родины к её воинственному прошлому.<br>&emsp;Когда начались Войны клонов, Мандалор сохранял позицию нейтралитета по отношению к Галактической Республике и Конфедерации независимых систем.',
    'naboo': '&emsp;Набу является родным миром для двух независимых обществ: гунганов, живущих в подводных городах, и людей Набу, обитающих в колониях на поверхности. Столица Набу — Тид, где проживает большинство людей Набу. Планета известна своим разнообразным ландшафтом, включающим густые болота, холмистые равнины и зелёные холмы.<br>&emsp;Архитектура Тида, столицы Набу, вдохновлена округом Марин в Калифорнии и спроектирована Фрэнком Ллойдом Райтом. Набу известна своей системой образования, искусством, защитой окружающей среды и научными достижениями. Вокруг Набу вращаются три луны: Ома-д’Ун, Оноам и Веруна.',
    'tatooin': '&emsp;Татуин — это пустынная планета, расположенная во Внешнем Кольце галактики. Она вращается вокруг двух звёзд, что создаёт уникальные условия для жизни.<br>&emsp;Планета известна своими огромными пустынями, жарким климатом и песчаными бурями. На Татуине есть несколько поселений, самое крупное из которых — Мос-Эйсли. Это космопорт, где можно встретить представителей разных рас и купить всё необходимое.<br>&emsp;На Татуине есть несколько видов растений, которые могут выживать в условиях пустыни. Это, например, кактусы и колючие кустарники. Среди животных можно выделить вомп-крыс, песчаных существ, похожих на грызунов, и крайт-драконов, опасных хищников.'
}

const duneDescription = {
    'arrakis': '&emsp;Арракис покрыт бесконечными пустынями, местами встречаются горные хребты, изрезанные многочисленными пещерами. На полюсах Дюны расположены ледяные шапки, что говорит о наличии на планете в прошлом воды, а следовательно, богатой растительности и животного мира. Небо Арракиса имеет серебристый цвет.<br>&emsp;Вся поверхность планеты покрыта красным песком, который является источником бесценного ресурса — пряности, вещества, необходимого для межзвёздных перелётов. Пряность обладает уникальными свойствами, позволяющими предсказывать будущее и продлевать жизнь.<br>',
    'arrakin': '&emsp;Арракин — это первый город на планете Арракис, известный также как Дюна. Он расположен в глубокой впадине, известной как Чаша, и окружён высокими стенами. Город служит административной столицей планеты и домом для правящего дома.<br>&emsp;Арракин построен из камня и металла, чтобы противостоять жестокому климату Дюны. В городе есть несколько районов, каждый из которых выполняет свою функцию. Например, в районе дворца живут представители правящего класса, а в районе рынка — торговцы и ремесленники.<br>',
    'dune': '&emsp;Пустыни Арракиса — это огромные пространства, покрытые красным песком, который является источником бесценного ресурса — пряности. Эти пустыни занимают большую часть поверхности планеты и отличаются экстремальными условиями: высокие температуры, низкая влажность и сильные ветры.<br>Пустыни Арракиса населены различными формами жизни, приспособленными к суровым условиям пустыни. Среди них песчаные черви — гигантские создания, способные поглощать огромное количество воды и пряности. Они играют ключевую роль в экосистеме планеты и являются источником пряности.',
    'freemans': '&emsp;Фримены — это группа людей, обитающих на планете Арракис, также известной как Дюна. Они являются коренными жителями этой пустынной планеты и приспособились к её жестокому климату. Фримены известны своими навыками выживания в экстремальных условиях, а также своей культурой и религией.<br>&emsp;Фримены — это группа людей, обитающих на планете Арракис, также известной как Дюна. Они являются коренными жителями этой пустынной планеты и приспособились к её жестокому климату. Фримены известны своими навыками выживания в экстремальных условиях, а также своей культурой и религией.',
    'plants': '&emsp;Растительность на планете Арракис крайне скудна и адаптирована к суровым условиям пустыни. Основные виды растений представлены ксерофитами, склерофитами и псаммофитами, что позволяет им выживать в условиях экстремальной засухи и песчаной почвы.<br>&emsp;Несмотря на суровые условия, некоторые виды растений способны выживать на Арракисе. Например, фримены используют специальные методы для выращивания небольших садов в своих сиетчах, используя воду и питательные вещества с особой осторожностью.',
    'spice': '&emsp;Это вещество образуется в глубинах планеты Арракис, в результате жизнедеятельности гигантских песчаных червей. Специя обладает рядом уникальных свойств, делающих её невероятно ценным ресурсом.<br>&emsp;Специя используется для продления жизни, улучшения умственных способностей и повышения выносливости. Она также необходима для межзвездных путешествий, поскольку позволяет навигаторам видеть сквозь пространство и время.',
    'worm': '&emsp;Шай-Хулуд, также известный как Песчаный червь - это гигантское кремнийорганическое создание, достигающее в длину до 400 метров и имеющее диаметр до 40 метров. Шай-Хулуд играет ключевую роль в экологии планеты Арракис, производя специю.<br>&emsp;Его внутренняя пищеварительная фабрика, с этой колоссальной концентраицей кислот и альдегидов, является гигантким источником кислорода. Средний червь выделяет в атмосферу столько же кислорода, сколько десять квадратных километров фотосинтезирующей зеленой растительности.<br>&emsp;Шай-Хулуд проходит несколько стадий развития, начиная с личинки песчаной форели, которая может выжить только в определенных условиях, и заканчивая взрослым червем. Взрослые особи способны выживать в самых экстремальных условиях, благодаря своей уникальной физиологии и способности поглощать огромное количество воды и пряности.'
}

const pages = {
    'lotr': '10',
    'sw': '8',
    'dune': '7'
}
const descriptionPath = '../descriptions/'
var scrollFlag = true
var currentPage = ""

function loadBody(page) {
    addEvents();
    loadText(page);
    currentPage = page
}

function addEvents() {
    window.addEventListener('wheel', async function (e) {
        if (scrollFlag){
            if (e.deltaY > 0) {
                window.scrollBy(window.innerWidth, 0)
                setAnimationText(-1, 1)
            }
            if (e.deltaY < 0) {
                window.scrollBy(-window.innerWidth, 0)
                setAnimationText(-1, -1)
            }
            setTimeoutScroll()
        }
    });
    window.addEventListener("keydown", function(e) {
        if(["Space","ArrowUp","ArrowDown","ArrowLeft","ArrowRight"].indexOf(e.code) > -1) {
            e.preventDefault();
            if (scrollFlag) {
                if (["ArrowLeft"].indexOf(e.code) > -1) {
                    window.scrollBy(-window.innerWidth, 0)
                    setAnimationText(-1, -1)
                } else if (["ArrowRight"].indexOf(e.code) > -1) {   
                    window.scrollBy(window.innerWidth, 0)
                    setAnimationText(-1, 1)
                }
                setTimeoutScroll()
            }
        }
    }, false); 
}

function loadText(page) {
    var paragraphs = document.getElementsByTagName('p');
    for (var i = 0; i < paragraphs.length; i++) {
        if (paragraphs[i].id == '') {
            continue;
        }
        if (page == 'lotr') {
            document.getElementById(paragraphs[i].id).innerHTML = lotrDescription[paragraphs[i].id]
        }
        if (page == 'sw') {
            document.getElementById(paragraphs[i].id).innerHTML = swDescription[paragraphs[i].id]
        }
        if (page == 'dune') {
            document.getElementById(paragraphs[i].id).innerHTML = duneDescription[paragraphs[i].id]
        }
    }
}

async function scrollToContent() {
    if (scrollFlag) {
        window.scrollBy(-99999999, 0)
        setAnimationText(0, -2)
        setTimeoutScroll()
    }
}

async function scrollArrowClick(key) {
    if (scrollFlag){
        if (key == 'Right') {
            window.scrollBy(window.innerWidth, 0)
            setAnimationText(-1, 1)
        }
        if (key == 'Left') {
            window.scrollBy(-window.innerWidth, 0)
            setAnimationText(-1, -1)
        }
        setTimeoutScroll()
    }
}

async function scrollToPage(pageId) {
    if (scrollFlag) {
        window.scrollBy((window.innerWidth * pageId), 0)
        setAnimationText(pageId, 2)
        setTimeoutScroll()
    }
}

function setTimeoutScroll() {
    scrollFlag = false
    this.setTimeout(() => {
        scrollFlag = true
        checkCurrentPosition()
    }, 1000)
}

//scrollType: 
//    1 - forward
//   -1 - backward
//    2 - toPage
//   -2 - toContent
//id = -1 --> calculating id 
function setAnimationText(id, scrollType) {
    if (id == -1) {
        id = calculateId(scrollType) - 2
    }
    //fade out
    if (scrollType == -1) {
        id += 2
        if ((id-1) == 0) {
            document.getElementsByClassName('block-text')[id].classList.add('hide-description')
            document.getElementsByClassName('block-text')[id-1].classList.add('show-content')
            setTimeout(() => {
                document.getElementsByClassName('block-text')[id].classList.remove('hide-description')
                document.getElementsByClassName('block-text')[id-1].classList.remove('show-content')
            }, 1100)   
        } else {
            document.getElementsByClassName('block-text')[id].classList.add('hide-description')
            document.getElementsByClassName('block-text')[id-1].classList.add('show-description')
            setTimeout(() => {
                document.getElementsByClassName('block-text')[id].classList.remove('hide-description')
                document.getElementsByClassName('block-text')[id-1].classList.remove('show-description')
            }, 1100)   
        }
    }
    //fade in
    if (scrollType == 1) {
        if (id == 0) {
            document.getElementsByClassName('block-text')[id].classList.add('hide-content')
            document.getElementsByClassName('block-text')[id+1].classList.add('show-description')
            setTimeout(() => {
                document.getElementsByClassName('block-text')[id+1].classList.remove('show-description')  
                document.getElementsByClassName('block-text')[id].classList.remove('hide-content')  
            }, 1100)
        } else {
            document.getElementsByClassName('block-text')[id].classList.add('hide-description')
            document.getElementsByClassName('block-text')[id+1].classList.add('show-description')
            setTimeout(() => {
                document.getElementsByClassName('block-text')[id+1].classList.remove('show-description')  
                document.getElementsByClassName('block-text')[id].classList.remove('hide-description')  
            }, 1100)
        }
    }
    if (scrollType == 2) {
        document.getElementsByClassName('block-text')[0].classList.add('hide-content')
        document.getElementsByClassName('block-text')[id].classList.add('show-description')
        setTimeout(() => {
            document.getElementsByClassName('block-text')[id].classList.remove('show-description')  
            document.getElementsByClassName('block-text')[0].classList.remove('hide-content')  
        }, 1100)   
    }
    if (scrollType == -2) {
        document.getElementsByClassName('block-text')[0].classList.add('show-content')
        setTimeout(() => {
            document.getElementsByClassName('block-text')[0].classList.remove('show-content')
        }, 1100)
    }
}

function calculateId(scrollType){    
    var id = 0
    var currentPosition = window.scrollX
    if (scrollType == 1) {
        currentPosition += window.innerWidth        
    } else if (scrollType == -1) {
        currentPosition -= window.innerWidth
    }
    for (var i = currentPosition; i >= 0; i -= window.innerWidth) {
        id++;
    }
    return id;
}

function checkCurrentPosition() {
    if (window.scrollX == 0) {
        document.getElementById('left-arrow').classList.remove('show-arrow')
        document.getElementById('left-arrow').classList.add('hide-arrow')
    } else {
        document.getElementById('left-arrow').classList.remove('hide-arrow')
        document.getElementById('left-arrow').classList.add('show-arrow')
    }
        if (window.scrollX == (window.innerWidth * pages[currentPage])) {
            document.getElementById('right-arrow').classList.remove('show-arrow')
            document.getElementById('right-arrow').classList.add('hide-arrow')
        } else {
            document.getElementById('right-arrow').classList.remove('hide-arrow')
            document.getElementById('right-arrow').classList.add('show-arrow')
        }
}

function changeFrame(frame){
    for (var item in pages) {
        if (item == frame) {
            document.getElementById(frame + '-frame').classList.remove('hidden-frame')
        } else {
            document.getElementById(item + '-frame').classList.add('hidden-frame')
        }
    }
    hideMenu();
}

function showMenu(){
    document.getElementById('menu').classList.remove('menu');
    document.getElementById('menu').classList.add('show-menu');
    document.getElementById('menu-title-h').classList.add('show-menu-title')
    document.getElementsByClassName('black-screen')[0].setAttribute('style', 'visibility: visible;');
}

function hideMenu(){
    document.getElementById('menu').classList.remove('show-menu');
    document.getElementById('menu-title-h').classList.remove('show-menu-title')
    document.getElementById('menu').classList.add('hide-menu');
    setTimeout(() => {
        document.getElementById('menu').classList.remove('hide-menu');
        document.getElementById('menu').classList.add('menu');
    }, 500)
    document.getElementsByClassName('black-screen')[0].setAttribute('style', 'visibility: hidden;');
}